Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: Sets the uiAccess attribute in each UIA file's embedded manifest.
fr: Définit l'attribut uiAccess dans le manifest intégré à chaque fichier UIA.

source: Setting values in an object is as simple as setting the value of a variable.
fr: Définir des valeurs dans un objet est aussi simple que définir la valeur d'une variable.

source: Setup will attempt to launch the scripts via Explorer, so they do not run as administrator if UAC is enabled.
fr: L'installation essaiera de lancer les scripts via l'Explorateur de fichiers, donc ils ne sont pas exécutés en tant qu'administrateurs si le contrôle du compte de l'utilisateur (UAC) est activé.

source: ShellExecute can be used instead.
fr: ShellExecute peut être utilisée à la place.

source: Short answer:
fr: Réponse courte :

source: Shows "target".
fr: Affiche "cible".

source: Shows the contents of target, i.e. "42".
fr: Affiche le contenu de cible, i.e. "42".

source: Similarly, new Alpha.Beta() would create an object derived from the object returned by Alpha.Beta; Beta is neither a function nor a method.
fr: De même, new Alpha.Beta() créerait un objet dérivé de l'objet renvoyé par Alpha.Beta ; Beta n'est ni une fonction ni une méthode.

source: Similarly, Join| inserts a pipe between lines.
fr: De même, Join| insère unne barre verticale entre les lignes.

source: Similarly, if the file contains a hotkey/hotstring, it may be considered the script's first hotkey/hotstring, which would act like return.
fr: De même, si le fichier contient un hotkey/hotstring, il peut être considéré comme le premier hotkey/hotstring du script, qui se comporterait comme return.

source: Similarly, the #If directives such as #IfWinActive cannot affect control flow; they merely set the criteria for any hotkey labels and hotstrings specified in the code.
fr: De même, les directives #If comme #IfWinActive ne peuvent avoir d'incidence sur le flux de contrôle ; elles ne font que définir les critères des hotkeys et hotstrings spécifiés dans le code.

source: Similarly, the following lines would get merged into a single line because the last two start with "and" or "or":
fr: De manière similaire, les lignes suivantes seraient fusionnées en une seule puisque les deux dernières commencent avec "and" ou "or" :

source: Similarly, the middle button and the turning of the mouse wheel should be assignable normally except on mice whose drivers directly control those buttons.
fr: De manière similaire, le bouton du milieu et la rotation de la molette de souris devraient être utilisables normalement sauf sur les souris où le pilote contrôle directement ces boutons.

source: Simple!
fr: Facile !

source: Simply replace the command name "Send" with one of the following:
fr: Il suffit de remplacer le nom de la commande "Send" par un des noms suivants :

source: Simply specify a window title.
fr: Il suffit d'indiquer un titre de fenêtre.

source: Simply specify an opening parenthesis on a new line, then your content, finally a closing parenthesis on its own line.
fr: Simplement écrire une parenthèse ouvrante sur une nouvelle ligne, puis le contenu, et enfin une parenthèse fermante sur sa propre ligne.

source: Simply type in your text and done.
fr: Il suffit d'écrire le texte.

source: Since a closing parenthesis indicates the end of a continuation section, to have a line start with literal closing parenthesis, precede it with an accent/backtick:
fr: Puisqu'une parenthèse fermante indique la fin d'une section de continuation, pour avoir une ligne commençant par une parenthèse fermante littérale, la précéder d'un accent grave/guillemet oblique :

source: Since commas and percent signs have special meaning, use the escape sequence `, to specify a literal comma and `% to specify a literal percent sign.
fr: Puisque les virgules et les signes pourcentage ont une signification particulière, la séquence d'échappement `, permet d'écrire une virgule littérale et `% d'écrire un signe pourcentage littéral.

source: Since comments are ignored when a script is launched, they do not impact performance or memory utilization.
fr: Puisque les commentaires sont ignorés lors de l'exécution d'un script, ils n'ont pas d'impact sur les performances ou l'utilisation mémoire.

source: Since the text has no explicit start and end marks, it ends at the end of the line or the end of the parameter.
fr: Puisque le texte n'a pas de début ou de fin explicits, il se termine à la fin de la ligne ou du paramètre.

source: Since you're viewing this documentation locally, you've probably already installed AutoHotkey and can skip to section b.
fr: Puisque cette documentation est locale, AutoHotkey est probablement déjà installé et la suite est en section b.

source: Single-line comments require a leading space if they are not at the start of the line.
fr: Les commentaires mono-ligne ont besoin d'un espace devant si ils ne sont pas au début d'une ligne.

source: Small code (25 lines or less) will probably be fine to read without indentation, but it'll soon get sloppy.
fr: Peu de code (25 lignes ou moins) sera probablement lisible sans indentation, mais deviendra peu soigné assez rapidement.

source: So I'll set it clear:
fr: Alors je vais être clair :

source: So a command would look like this:
fr: Donc une commande ressemblerait à :

source: So it won't be covered in the tutorial, at least, not right now.
fr: Donc elles ne seront pas traitées dans ce tutoriel, ou du moins pas tout de suite.

source: So no need for a bunch of Send commands with one letter each.
fr: Donc pas besoin de plusieurs commandes Send avec une lettre chacune.

source: So now that you have created a script, we need to add stuff into the file.
fr: Maintenant que le script est créé, il faut ajouter du contenu au fichier.

source: So now you decided that you want to send (type) keys to a program.
fr: Vous avez donc décidé d'envoyer (taper) des touches à un programme.

source: So please remember to check the table on the Send page and make sure you have your brackets in the right places.
fr: Il faut donc penser à consulter le tableau sur la page de Send pour être certain que les accolades sont au bon endroit.

source: So thanks to Jon and the other AutoIt authors for those as well.
fr: Donc merci à Jon et les autres auteurs de AutoIt pour ça aussi.

source: So try ALL of these before giving up.
fr: Avant d'abandonner, TOUT essayer.

source: So we will need to tell it what to do.
fr: Donc il va falloir lui dire quoi faire.

source: So you could simply do this if you wanted:
fr: Donc si cela suffit il est possible de simplement écrire :

source: Software License:
fr: Licence du logiciel :

source: Some common errors, such as typos and missing "global" declarations, can be detected by enabling warnings.
fr: Certaines erreurs courantes, comme des fautes de frappes et des déclarations manquantes de "globales", peuvent être détectées en activant les avertissements.

source: Some configurations of Windows IME (such as Japanese input with English keyboard) use CapsLock to toggle between modes.
fr: Certaines configurations de Windows IME (telles que l'entrée japonaise avec un clavier anglais) utilisent VerrMaj pour basculer entre les modes.

source: Some examples:
fr: Quelques exemples :

source: Some keys do not generate events and thus will not be visible here.
fr: Certaines touches ne génèrent pas d'événements et ne seront donc pas visibles ici.

source: Some of the variables in the pseudo-array may be inaccessible if they are not individually declared.
fr: Certaines des variables dans le pseudo-tableau peuvent être inaccessibles si elles ne sont pas déclarées individuellement.

source: Some older versions of AutoHotkey_L used 1.0.* version numbers, so for clarity, this document refers to the two branches of AutoHotkey by name rather than version number.
fr: Certaines anciennes versions d'AutoHotkey_L utilisaient les numéros de version 1.0. *, Donc pour plus de clarté, ce document fait référence aux deux branches d'AutoHotkey par nom plutôt que par numéro de version.

source: Some other common escape sequences produce special characters, such as `t (tab), `n (linefeed), and `r (carriage return).
fr: D'autres séquences d'échappement courantes produisent des caractères spéciaux, comme `t (tabulation), `n (saut de ligne), et `r (retour chariot).

source: Some other syntax errors are currently not detected, but cause problems with AutoHotkey_L:
fr: Certaines autres erreurs de syntaxe ne sont actuellement pas détectées, mais provoquent des problèmes avec AutoHotkey_L:

source: Some other syntax errors are detected while the script is running.
fr: Certaines autres erreurs de syntaxe sont détectées pendant l'exécution du script.

source: Some programs need to be started in their own directories (when in doubt, it is usually best to do so).
fr: Certains programmes doivent être lancés dans leur propre dossier (dans le doute, il est préférable que ce soit le cas).

source: Some unary and binary operators share the same symbols, in which case the meaning of the operator depends on whether it is written before, after or in between two values.
fr: Certains opérateurs unaires et binaires partagent les même symboles, auquel cas la signification de l'opérateur dépend de s'il est écrit avant, après ou entre les valeurs.

source: Some users may find it easier to always force an expression, keeping to one consistent syntax (expression syntax) as much as possible.
fr: Certains utilisateurs peuvent trouver plus facile de toujours forcer une expression, en gardant une syntaxe cohérente (la syntaxe avec expressions) autant que possible.

source: Some windows refuse to be automated (e.g. Device Manager ignores Send).
fr: Certaines fenêtres refusent d'être automatisées (par exemple le Gestionnaire de périphériques ignore Send).

source: Sometime you might want a hotkey or hotstring to only work (or be disabled) in a certain window.
fr: Parfois il peut être souhaitable qu'une hotkey ou un hotstring ne fonctionne (ou ne soit désactivé) que dans une certaine fenêtre.

source: Sometimes games have a hack and cheat prevention measure, such as GameGuard and Hackshield.
fr: Parfois les jeux ont des systèmes anti-triche, come GameGuard et Hackshield.

source: Sometimes it's a mix of both, and sequential numbers too!
fr: Parfois c'est un mix des deux, ou des entiers à partir de 1 !

source: Sometimes objects are referred to as arrays, but it's important to note that all arrays are just objects.
fr: Les objets sont parfois désignés comme tableaux, mais il est important de remarquer que tous les tableaux ne sont que des objets.

source: Sometimes system policies or other factors prevent the files from being extracted or executed.
fr: Parfois la configuration du système ou d'autres facteurs empêchent les fichiers d'être extraits ou exécutés.

source: Sometimes the value a parameter accepts is written directly in the syntax block.
fr: Parfois la valeur acceptée par un paramètre est directement écrite dans le bloc de syntaxe.

source: Sometimes these options are overridden by settings in the current user's profile, such as if Open With has been used to change the default program for opening .ahk files.
fr: Parfois ces options sont remplacées par des paramètres du profil de l'utilisateur courant, comme si Ouvrir avec avait été utilisé pour changer le programme par défaut pour ouvrir les fichiers .ahk.

source: Sometimes you want to have the user to choose the value of stuff.
fr: Parfois il est souhaitable que l'utilisateur choisisse une valeur dans un but quelconque.

source: Somewhere near the bottom are the key-down and key-up events for your key.
fr: Quelque part vers le bas se trouvent les événements touche enfoncée (key-down) et touche relâchée (key-up) pour votre clé / touche.

source: SoundSet and SoundGet work better on Vista and later
fr: SoundSet et SoundGet fonctionnent mieux sur Vista et versions ultérieures

source: Spaces and tabs are generally ignored at the end of a line, within an expression (except between quotes), and before and after command parameters.
fr: Les espaces et tabulations sont généralement ignorés à la fin d'une ligne, dans une expression (sauf entre guillemets), et avant et après les paramètres d'une commande.

source: Spaces are required when performing concatenation.
fr: Les espaces sont requis pour effectuer une concaténation.

source: Spaces may be required between two operators, to remove ambiguity.
fr: Des espaces peuvent être requis entre deux opérateurs, pour lever une ambiguïté.

source: Special Keys
fr: Touches Spéciales

source: Specific details about syntax (how to write scripts).
fr: Détails spécifiques sur la syntaxe (comment écrire des scripts).

source: Specifically, send a key-up to modify the state of the IME, but prevent any other effects by signalling the keyboard hook to suppress the event.
fr: Plus précisément, envoyez une touche (key-up) pour modifier l'état de l'IME, mais évitez tout autre effet en signalant au hook clavier de supprimer l'événement.

source: Specifies how lines should be connected together.
fr: Indique comment les lignes devraient être jointes ensemble.

source: Specify a percent sign followed by a space or tab to force a parameter to accept an expression.
fr: Indiquer un signe pourcentage suivi d'un espace ou d'une tabulation force un paramètre à accepter une expression.

source: Specify for nn the hexadecimal virtual key code of a key.
fr: Spécifiez pour nn le code hexadécimal de la touche virtuelle d'une touche.

source: Specify for nnn the scan code of a key.
fr: Spécifiez pour nnn le code de balayage d'une touche.

source: Splitting a Long Line into a Series of Shorter Ones
fr: Diviser une Longue Ligne en une Série de Lignes Plus Courtes

source: Step through code line by line - step into, over or out of functions and subroutines.
fr: Exécuter le code ligne par ligne - entrer dans, survoler ou sortir de fonctions et sous-programmes.

source: Stop
fr: Arrêter

source: StringReplace, NewStr, OldStr, %A_Space%, +, All
fr: StringReplace, NouvelleChaine, AncienneChaine, %A_Space%, +, All

source: Strings / Text
fr: Chaînes de caractères / Texte

source: Structure of a Script
fr: Structure d'un Script

source: SubStr("I'm scripting, awesome!", 16)
fr: SubStr("Génial je scripte !", 16)

source: Subroutines
fr: Sous-programmes (subroutines)

source: Subroutines should typically be defined separately to any other block of code, but can also be defined inside a function, allowing the subroutine access to that function's static variables (and local variables, but only while the function is running).
fr: Les sous-programmes devraient typiquement être définis séparément de tous les autres blocs de code, mais peuvent aussi être définis à l'intérieur d'une fonction, permettant au sous-programme d'accéder aux variables statiques de la fonction (et aux variables locales, mais seulement pendant l'exécution de la fonction).

source: Such a keystroke can then be defined as a hotkey in a script.
fr: Ces frappes peuvent ensuite être définies comme hotkey dans un script.

source: Such comments (along with any spaces and tabs to their left) are entirely omitted from the joined result rather than being treated as literal text.
fr: De tels commentaires (ainsi que tout espace ou tabulation à leur gauche) sont entièrement ignorés dans la ligne résultante au lieu d'être traités comme du texte littéral.

source: Such errors may be difficult to detect.
fr: De telles erreurs peuvent être difficiles à détecter.

source: Such expressions might become invalid in the future due to enhanced error-checking.
fr: De telles expressions peuvent devenir invalide à l'avenir de par une vérification améliorée des erreurs.

source: Suspend Hotkeys - Suspend or unsuspend hotkeys.
fr: Suspend Hotkeys - Suspend ou dé-suspend les hotkeys.

source: Switch
fr: Commutateur

source: Symbol
fr: Symbole

source: Syntax Errors
fr: Erreurs de syntaxe

source: Table of Contents
fr: Table des Matières

source: Ternary expressions such as x ? CallIfTrue() : CallIfFalse().
fr: Les expressions ternaires comme x ? AppelerSiVrai() : AppelerSiFaux().

source: Testing shows that due to file caching, a temporary file can be very fast for relatively small outputs.
fr: L'expérimentation montre que grâce à la mise en mémoire cache des fichiers, un fichier temporaire peut être très rapide pour des sorties relativements petites.

source: Text
fr: Texte

source: Text Parameters
fr: Paramètres Texte

source: Text editors with AutoHotkey support
fr: Editeurs de texte compatibles avec AutoHotkey

source: Text instructions:
fr: Instructions textuelles :

source: Text needs to be wrapped in quotes:
fr: Le texte doit être entouré de guillemets :

source: Text parameters accept unquoted text.
fr: Les paramètres texte acceptent du texte sans guillemets.

source: Text parameters can also accept a forced expression.
fr: Les paramètres texte peuvent aussi accepter une expression forcée.

source: Thanks to expressions, you can do math!
fr: Grâce aux expressions, des calculs peuvent être faits !

source: That fixes some DirectX issues.
fr: Cela résout certains problèmes de DirectX.

source: That is FALSE.
fr: C'est FAUX.

source: That is, both Alpha and Index are variables in this case, and could be replaced with virtually any sub-expression.
fr: C'est-à-dire, à la fois Alpha et Index sont des variables dans ce cas, et peuvent être remplacées par pratiquement n'importe quelle sous-expression.

source: That's fancy talk for "do pretty much anything".
fr: C'est une manière compliquée de dire "faire à peu près n'importe quoi".

source: The "index" used to form the final variable name does not have to be numeric; it could instead be a letter or keyword, making the pseudo-array similar to an associative array or an object.
fr: L'"index" utilisé pour former le nom final des variables n'a pas à être numérique ; il peut être à la place une lettre ou un mot-clé, rendant le pseudo-tableau semblable à un tableau associatif ou un objet.

source: The "legacy" If statements are as follows:
fr: Les instructions If "dépassées" (legacy) sont les suivantes :

source: The #IfWin directives are positional:
fr: Les directives #IfWin ont un effet lié à leur position :

source: The $ prefix is needed to prevent a warning dialog about an infinite loop (since the hotkey "sends itself").
fr: Le préfixe $ est nécessaire pour empêcher l'affichage d'un avertissement sur une boucle infinie (puisque la hotkey "s'envoie elle-même").

source: The /ErrorStdOut switch can be used to suppress or capture the error message.
fr: Le commutateur /ErrorStdOut peut être utilisé pour supprimer ou capturer le message d'erreur.

source: The 12 or more function keys at the top of most keyboards.
fr: Les 12 touches de fonction ou plus en haut de la plupart des claviers.

source: The 5th and 6th axes of the joystick.
fr: Les 5ème et 6ème axes du joystick.

source: The #Include directive causes the script to behave as though the specified file's contents are present at this exact position.
fr: La directive #Include (inclure) fait se comporter le script comme si le contenu du fichier spécifié était présent à cette endroit exact.

source: The #NoTrayIcon directive can be used to hide the tray icon.
fr: La directive #NoTrayIcon permet de cacher l'icône de zone de notification.

source: The EnvAdd command can add or subtract a quantity of days, hours, minutes, or seconds to a time-string that is in the YYYYMMDDHH24MISS format.
fr: La commande EnvAdd peut ajouter ou soustraire une quantité de jours, heures, minutes ou secondes à une chaîne de caractère temporelle dans le format AAAAMMDDHH24MISS.

source: The Format function can also be used for this purpose.
fr: La fonction Format peut aussi être utilisée dans le même but.

source: The Menu command can be used to customise the tray icon and menu.
fr: La commande Menu permet de personnaliser l'icône et le menu.

source: The body of a control flow statement is always a single group of statements.
fr: Le corps d'une instruction de flux de contrôle est toujours un unique groupe d'instructions.

source: The gigantic table on the Send page shows pretty much every special key built-in to AHK.
fr: Le gigantesque tableau sur la page de Send montre à peu près toutes les touches spéciales intégrées à AutoHotkey.

source: The percent-space prefix causes a command parameter to be interpreted as an expression.
fr: Le préfixe pourcent-espace permet d'interpréter un paramètre comme une expression.

source: The ternary operator is also a good candidate:
fr: L'opérateur ternaire est aussi un bon candidat :

source: The soundcard analysis script can be used to find the correct device numbers.
fr: Le script d'analyse carte son permet de trouver les nombres de périphérique corrects.

source: The -RAW suffix can be omitted, but in that case any newly created files will have a byte order mark.
fr: Le suffixe -RAW (brut) peut être omis, mais dans ce cas tout fichier nouvellement créé aura un indicateur d'ordre des octets.

source: The Var parameter of any legacy If command.
fr: Le paramètre Var d'une commande If dépassée (legacy).

source: The Separate taskbar buttons option disables this by registering each AutoHotkey executable as a host app (IsHostApp).
fr: L'option Separate taskbar buttons (séparer les boutons de la barre des tâches) empêche ce comportement en enregistrant chaque exécutable AutoHotkey comme host app (IsHostApp).

source: The Basics
fr: Les Bases

source: The EXE file is produced using the same custom icon, .bin file and use MPRESS setting that were last used by Method #1 above.
fr: Le fichier EXE est généré avec les mêmes icône personnalisée, fichier .bin et utilise le paramètre MPRESS ayant été utilisés la dernière fois par la Méthode #1 ci-dessus.

source: The Top of the Script (the Auto-execute Section)
fr: Le Haut du Script (Section d'Auto-exécution)

source: The X (horizontal), Y (vertical), and Z (altitude/depth) axes of the joystick.
fr: ​​Les axes X (horizontal), Y (vertical) et Z (altitude / profondeur) du joystick.

source: The above code is perfectly acceptable.
fr: Le code ci-dessus est parfaitement acceptable.

source: The asterisk must immediately precede the closing parenthesis at the end of the function's parameter list.
fr: L'astérisque doit immédiatement précéder la parenthèse fermante à la fin de la liste des paramètres de la fonction.

source: The auto-execute section is often used to configure settings which apply to every newly launched thread.
fr: La section d'auto-exécution est souvent utilisée pour configurer les paramètres qui s'appliquent à tout fil d'exécution (thread) nouvellement lancé.

source: The built-in variable A_ScriptHwnd contains the unique ID (HWND) of the script's main window.
fr: La variable intégrée A_ScriptHwnd contient l'ID unique (HWND) de la fenêtre principale du script.

source: The built-in variable A_Index contains the number of the current loop iteration.
fr: La variable intégrée A_Index contient le numéro de l'itération actuelle de la boucle.

source: The built-in variable A_IsCompiled contains 1 if the script is running in compiled form.
fr: La variable intégrée A_IsCompiled contient 1 si le script est exécuté sous forme compilée.

source: The buttons of the joystick.
fr: Les boutons du joystick.

source: The characters [, ] and ? are reserved for use in expressions, so are no longer valid in variable names.
fr: Les caractères [, ] et ? sont réservés pour une utilisation dans les expressions, ils ne sont donc plus valides dans les noms de variables.

source: The characters a script file may contain are restricted by the codepage used to load the file.
fr: Les caractères qu'un fichier de script peut contenir sont restreints par la page de caractère (codepage) utilisée pour charger le fichier.
